import { Schedule } from './types';

export const mockSchedule: Schedule = {
    'ИС-101': {
        'Понедельник': {
            '2': 'Математика',
            '3': 'Физика',
            '4': 'Программирование'
        },
        'Вторник': {
            '1': 'История',
            '2': 'Английский',
            '3': 'Физика'
        },
        'Среда': {
            '5': 'Программирование',
            '6': 'Базы данных'
        },
        'Четверг': {
            '3': 'Математика',
            '4': 'Физика',
            '5': 'История'
        },
        'Пятница': {
            '2': 'Английский',
            '3': 'Программирование',
            '4': 'Базы данных'
        }
    },
    'ИС-102': {
        'Понедельник': {
            '3': 'Физика',
            '4': 'Математика',
            '5': 'История'
        },
        'Вторник': {
            '2': 'Программирование',
            '3': 'Английский',
            '4': 'Базы данных'
        },
        'Среда': {
            '1': 'Математика',
            '2': 'Физика',
            '3': 'История'
        },
        'Четверг': {
            '4': 'Программирование',
            '5': 'Английский',
            '6': 'Базы данных'
        },
        'Пятница': {
            '3': 'Математика',
            '4': 'Физика',
            '5': 'Программирование'
        }
    }
}; 